// -----------------------------------------------------------------------------
// constant : 정적 변수들 설정
// -----------------------------------------------------------------------------

export default {
    /** 디버그 모드 */
    DEBUG           : true,
    /** 프로파일 활성 */
    PROFILE         : false,
    /** 데이터베이스 사용 */
    DATABASE        : false,
    /** 맵 가로사이즈 */
    MAP_WIDTH       : 1280,
    /** 맵 세로사이즈 */
    MAP_HEIGHT      : 1280,
    /** 클라이언트 스크린 넓이 */
    SCREEN_WIDTH    : 500,
    /** 클라이언트 스크린 높이 */
    SCREEN_HEIGHT   : 500,
    /** three.js 테스트 모드 */
    TEST_THREE      : true,
};
